[{"GO ID": "GO7454", "Agency": "Department of Defence", "Close Date & Time": "28-Feb-2025 12:00 pm(ACT Local Time)Show close time for other time zones", "Primary Category": "361002 - Defence", "Publish Date": "8-Jan-2025", "Location": "ACT, NSW, VIC, SA, WA, QLD, NT, TAS, Overseas", "Selection Process": "Open Competitive", "Description": "This grant opportunity is part of the Strategic Policy Grants Program (SPGP), which supports strategic policy research relevant to the Department of Defence’s purpose, mission and priorities.The SPGP is an annual, open and competitive grants opportunity administered by Defence. Defence has run the program since 2019.The SPGP funds independent, unclassified, strategic policy-focused research and related activities; including  conferences, dialogues, seminars, education modules, roundtables, and scenario exercises.The objective of the program is to support the achievement of Defence’s mission and purpose by:deepening public debate about Australia’s strategic and defence policy choices;informing the development of Australia’s defence policy and strategy;strengthening Defence’s international and domestic partnerships; andbroadening participation in Australia’s strategic and defence policy debate.The intended outcomes of the program are:the publication of original, well-informed and policy-relevant research;engagements between Defence and leading non-government experts;events and activities involving Defence’s international and domestic counterparts; andfostering new and emerging talent in Australia’s strategic and defence policy debate.", "Eligibility": "Applications for SPGP 2025 must be lodged by organisations holding an Australian Business Number (ABN) or equivalent overseas business registration number. Individuals with different organisational affiliations can submit a joint (or consortium) application to SPGP 2025, but must identify a project lead as well as a lead organisation accountable to the Australian Government, via Defence, for any agreed grant activities. Should a joint application succeed, the lead organisation will enter into a grant agreement with the Australian Government, represented by Defence. Consortium applications must identify all members of the proposed consortium, and include a signed letter from each proposed member indicating endorsement of the application.Defence welcomes applications to 2025 SPGP from new and emerging as well as established strategic and defence studies experts. Established strategic and defence studies experts must design their activities to broaden participation in Australia’s strategic and defence policy debate by promoting increased participation by new and emerging talent.The 2025 SPGP is a global initiative that welcomes applicants from all countries, regardless of citizenship or residence. The SPGP's focus is on Australia's strategic and defence policy choices, but applicants are not required to be Australian citizens or residents. They must however collaborate with an Australian think tank or academic institution for a portion or the entirety of the grant activity. The SPGP encourages international perspectives and diverse backgrounds to enrich the understanding and analysis of global strategic policy issues.", "Total Amount Available (AUD)": "$3,500,000.00", "Estimated Grant Value (AUD)": "From$0.00to$500,000.00", "Instructions for Application Submission": "To apply you must:complete the 2025 SPGP application form, available for download on GrantConnectprovide all the information requestedaddress all eligibility criteria and assessment criteriainclude all necessary attachmentssubmit your application (in Word format) to sp.grants@defence.gov.au by 12:00 PM (AEST) on 28 February 2025."}, {"GO ID": "GO7551", "Agency": "Department of Health and Aged Care", "Close Date & Time": "28-Feb-2025 2:00 pm(ACT Local Time)Show close time for other time zones", "Internal Reference ID": "P6708", "Primary Category": "231013 - Medical Research", "Publish Date": "26-Feb-2025", "Location": "QLD", "Selection Process": "Closed Non-Competitive", "FO Reference": "P6708", "Description": "This grant opportunity was announced  by the Treasurer, the Hon Dr Jim Chalmers MP on 18 December 2024 as part of the 2024-25 Mid-Year Economic and Fiscal Outlook.The purpose of this grant opportunity is for the Australian Government to provide $2 million as its contribution to the Channel Nine Queensland Telethon Supporting Mater Little Miracles to be held on 26 April 2025. Funding will enable the Mater Foundation in Queensland to support perinatal medical research projects.To view the grant opportunity documents, please select the red \"Grant Opportunity Documents\" button on the left-hand side.", "Eligibility": "To be eligible, you must be the listed organisation and have received an invitation to apply from the department.The Trustee for the Mater Foundation (ABN: 96 723 184 640)The eligible organisation was determined as suitable to apply for the grant opportunity because it has been assessed to have:capability to deliver the grant activities within the target location,existing infrastructure and relationships to support project activities,experience and capability to deliver the grant activities in accordance with the objectives and outcomes,demonstrated value for money to deliver outcomes in the current market, andrelevant specialised expertise and stakeholder relationships specific to the needs of the grant opportunity.The Trustee for the Mater Foundation is a community-based fundraising organisation that supports the work of Mater Health, Mater Education and Mater Research. It raises funds through a wide range of programs to help support Mater’s provision of exceptional care, education and investment in world-leading medical research. Mater Mothers’ Hospitals is Australia’s largest and most experienced maternity service provider, delivering more than 12,000 babies every year.Every year, more than 2,000 seriously ill and premature babies come to Mater Mothers’ Hospitals’ Neonatal Critical Care Unit at South Brisbane to receive around the clock specialist life-saving care. Mater Research is a recognised leader in medical research. One of its key focus areas, Mother and Baby, includes research on improving clinical management of pregnancy complications, advancing the care and outcomes for sick neonates, and studying the relationship between fetal development, early life experience and lifelong health.", "Grant Activity Timeframe": "Potential grantees are advised that an election for the House of Representatives may be called before this grant process has been concluded. If an election is called and the House of Representatives is dissolved, then caretaker arrangements will apply to the business of Government. By convention, decisions are not taken during this period that would bind an incoming Government and limit its freedom of action. Consequently, potential grantees need to be aware that any grant processes which have not been concluded before the caretaker period, or which commence during the caretaker period, may experience delays in finalisation and could potentially be revised or cancelled.", "Total Amount Available (AUD)": "$2,000,000.00", "Instructions for Application Submission": "Submit the completed application form and all necessary attachments by the closing date and time via the red Submit Application button on the left-hand side.You should keep a copy of your application and any supporting documents. Registered users will receive an automated email notification acknowledging the receipt of the submission. If you do not receive an automated email notification within 24 hours of submission, please emailGrant.ATM@health.gov.au.For technical assistance when submitting your application through GrantConnect please contact the GrantConnect Helpdesk:Phone: 1300 484 145Email:GrantConnect@finance.gov.au", "Other Instructions": "Applicant/s should follow the below instructions to upload their application:Filename(s) do not exceed 100 characters.Any file type can be submitted to GrantConnect.Refrain from using special characters. These include, but are not limited to, colon, forward and back slash, question marks, en and em dash.A maximum of five (5) separate files can be submitted at one time.Do not include macros or password protect applications or attachments."}, {"GO ID": "GO7334", "Agency": "Department of Employment and Workplace Relations", "Close Date & Time": "28-Feb-2025 5:00 pm(ACT Local Time)Show close time for other time zones", "Internal Reference ID": "SEE-DG-2024-25 R2", "Primary Category": "191003 - Literacy and Numeracy Support", "Publish Date": "18-Nov-2024", "Location": "ACT, NSW, VIC, SA, WA, QLD, NT, TAS", "Selection Process": "Open Competitive", "FO Reference": "SEE_FNG_DG2024", "Description": "The SEE Program includes two distinct but complementary streams to support LLND skills training in metropolitan, regional, and remote areas:•Stream 1:LLND skills training delivery to individuals by SEE providers, contracted by the department, including through place-based project delivery.•Stream 2: SEE First Nations- locally tailored, whole of community LLND skills training delivery to First Nations people through place-based grants. SEE First Nations grants will fund First Nations organisations, including Aboriginal Community Controlled Organisations (ACCOs), registered training organisations (RTOs), Adult and Community Education (ACE) providers or peak bodies (applying on behalf of their eligible members).SEE First Nations grants will fund locally tailored, place-based, whole of community projects designed to meet community English LLND skills training needs of First Nations people.Improving English LLND skills is a stepping stone to improving:• individual, family and community wellbeing, and• cultural and social outcomes.SEE First Nations offers two different grant opportunities:Scoping GrantsSmall grants of up to $30,000 (excluding GST) to help eligible organisations to develop a Delivery Grant application.Delivery GrantsGrants to eligible organisations for English LLND skills training to First Nations people across Australia. The training is to be co-designed with the community/communities in which it will be delivered.Delivery Grants will typically be for between $350,000 and $1,000,000 (excluding GST) per year over a 2 to 3 year period, for a single site, or up to $3,000,000 (excluding GST) per year for delivery at multiple sites.This is the major component of SEE First Nations.", "Eligibility": "To be eligible to apply for a Delivery Grant, your organisation must be either a:ACCOFirst Nations RTOFirst Nations ACE provider (which may or may not be RTOs)First Nations Community Organisation peak bodies (applying on behalf of their eligible members)and have the legal capacity to enter into a grant agreement with the Commonwealthbe affiliated with the community/communities on whose behalf they apply or partnering with an organisation that is. In the case of a peak body this refers to the community affiliation of the member organisation you are applying on behalf of. Community affiliation can be demonstrated by providing evidence such as:annual reports showing us that you have local community involvement at a board/employment level etc.statements of support from community leaders.", "Grant Activity Timeframe": "2 to 3 years (with a maximum period of up to 5 years)", "Total Amount Available (AUD)": "$46,800,000.00", "Estimated Grant Value (AUD)": "From$350,000.00to$3,000,000.00", "Instructions for Application Submission": "Location for submission of Delivery Grant applications will be via GrantConnect", "Addenda Available": "View Addenda"}, {"GO ID": "GO7475", "Agency": "Australian Securities and Investments Commission", "Close Date & Time": "28-Feb-2025 5:00 pm(ACT Local Time)Show close time for other time zones", "Internal Reference ID": "Abandoned Company Liquidator Panel", "Primary Category": "151004 - Legal Services", "Secondary Category": "261002 - Small Business", "Publish Date": "16-Jan-2025", "Location": "ACT, NSW, VIC, SA, WA, QLD, NT, TAS", "Selection Process": "Open Competitive", "Description": "ASIC is seeking to establish a new panel of registered liquidators who are prepared to accept appointments as liquidator of abandoned companies.This grant opportunity is part of the Assetless Administration Fund (AAF) which contributes to ASIC’s outcomes of establishing a panel of suitably qualified and experienced registered liquidators to perform the services of winding up a company where ASIC considers it is likely to assist employees to access their unpaid employee entitlements under the FEG Act or likely to result in regulatory benefit to ASIC and the wider community, after ASIC has ordered the winding up of a company under Part 5.4C of the Corporations Act 2001.", "Eligibility": "To be eligible for a grant you must be appointed liquidator of a company by ASIC:under Part 5.4C of the Corporation Act; andbe a Panel menber.To be eligible for the Panel you must:be a registered liquidator under Part 2 of Schedule 2 of the Corporation Act and be able to provide the services in at least one or more State or Territory;have been a registered liquidator for five or more years;have an Australian Business Number (ABN); andbe a permanent resident of Australia.", "Grant Activity Timeframe": "The Abandoned Company Liquidator Panel needs to be in place by 6 July 2025.", "Total Amount Available (AUD)": "$16,500.00", "Instructions for Application Submission": "Applications must be received by email toliqpanelaplns@asic.gov.auprior to5pmAEDTon28 February 2025", "Other Instructions": "Nil"}, {"GO ID": "GO7529", "Agency": "Department of Social Services", "Close Date & Time": "3-Mar-2025 5:00 pm(ACT Local Time)Show close time for other time zones", "Internal Reference ID": "2024-3915", "Primary Category": "251002 - Indigenous Communities", "Publish Date": "25-Feb-2025", "Location": "NSW", "Selection Process": "One-off/Ad hoc", "Description": "The Australian Government is inviting applications via a one-off ad hoc process to apply to deliver services under the Closing the Gap Outcomes and Evidence Fund – Dubbo Service Delivery Agreement – Ad hoc ending 30 June 2026.The Fund is a $38.6 million program for First Nations people, organisations and communities to co-design, trial and evaluate projects aimed at contributing to Closing the Gap Targets 12 (out-of-home care) and 13 (family violence) and improve the evidence base for the Australian Government and First Nations people.Target 12: By 2031, reduce the rate of over-representation of Aboriginal and Torres Strait Islander children in out-of-home care by 45 per cent, and/or:Target 13: By 2031, the rate of all forms of family violence and abuse against Aboriginal and Torres Strait Islander women and children is reduced at least by 50 per cent, as progress towards zero.All trial projects will be subject to an evaluation. The objective of the evaluation is to collect evidence and assess trial outcomes. All trial projects will also contribute to an overarching evaluation of the Fund.", "Eligibility": "The organisations listed at section 3.1 of the Grant Opportunity Guidelines are invited to submit a Letter of Invitation using the individualised form emailed to them.", "Instructions for Application Submission": "By invitation only."}, {"GO ID": "GO7533", "Agency": "Department of Social Services", "Close Date & Time": "4-Mar-2025 9:00 pm(ACT Local Time)Show close time for other time zones", "Internal Reference ID": "2024-2669", "Primary Category": "171004 - Services for People with Disabilities", "Publish Date": "19-Feb-2025", "Location": "ACT, NSW, VIC, SA, WA, QLD, NT, TAS", "Selection Process": "Closed Non-Competitive", "Description": "The Australian Government is inviting Australia Post via a closed non-competitive process to apply to deliver services under the PCB Program nationally from FY2025-26 to FY2028-29.The PCB program enables eligible participants and recognised organisations to send or receive eligible items through the postal system at concession rates.The PCB Program aims to improve access to information and resources for people who are blind or vision-impaired by providing concessional or no-cost postal rates for the cost of posting certain items and products used by people who are blind or vision-impaired.", "Eligibility": "To be eligible you must be the invited organisation listed at 4.1 of the guidelines and have received an invitation to apply throughGrantConnect.", "Instructions for Application Submission": "By invitation only."}, {"GO ID": "GO7573", "Agency": "Department of Home Affairs", "Close Date & Time": "5-Mar-2025 9:00 pm(ACT Local Time)Show close time for other time zones", "Internal Reference ID": "2024-4286", "Primary Category": "161003 - Multiculturalism", "Publish Date": "27-Feb-2025", "Location": "VIC", "Selection Process": "One-off/Ad hoc", "Description": "The Australian Government is inviting Congregation Adass Israel via a one off ad hoc process to apply for the Replacement and Restoration of Torah Scrolls for the Congregation Adass Israel grant, from May 2025 to 2026.On 6 December 2024, an arson attack took place at the Adass Israel Synagogue in Ripponlea, Victoria, resulting in damage to religiously significant Torah Scrolls.The outcome contributes to the achievement of Program 2.5 - Multicultural Affairs and Citizenship Program within Outcome 2 of the Department of Home Affairs Portfolio Budget Statement.The purpose and objectives of the Multicultural Affairs and Citizenship Program are to:support small culturally diverse community organisations and groups in Australia that provide cultural activities, and community programs and eventsbuild upon Australia’s multicultural success with a particular focus on building social cohesionencourage new migrants to participate in events which promote Australian values and liberal democracyenable interaction between new migrants and local elected members of government, such as councillors, mayors, and Commonwealth, state and territory Members of Parliament in order to encourage greater participation in civic life in Australia.This grant will be administered by the Community Grants Hub on behalf of the Department of Home Affairs.The grant is to be undertaken in accordance with the Commonwealth Grants Rules and Principles 2024 (CGRPs).", "Eligibility": "To be eligible to receive a grant, you must be the invited organisation and have received an invitation to apply for this grant opportunity.", "Instructions for Application Submission": "By invitation only."}, {"GO ID": "GO7428", "Agency": "Department of Health and Aged Care", "Close Date & Time": "6-Mar-2025 2:00 pm(ACT Local Time)Show close time for other time zones", "Internal Reference ID": "P6539", "Primary Category": "101001 - Aged Care", "Publish Date": "28-Jan-2025", "Location": "ACT, NSW, VIC, SA, WA, QLD, NT, TAS", "Selection Process": "Demand Driven", "FO Reference": "P6539", "Description": "This grant opportunity provides $21.326 million in 2025 - 26 to fund wage increases effective from 1 January 2025. The purpose of this grant opportunity is to provide one-off funding to eligible providers to pay eligible aged care workers to take their leave entitlements at the higher rates of pay for Tranche 1 increases only that begin to take effect from 1 January 2025.Residential Aged Care providers for 25 per cent of the eligible increase to leave entitlements associated with paying the higher cost of leave entitlements for aged care workers whose wages have increased as a result of the FWC’s decision.50 per centof the eligible increase to leave entitlements associated with paying the higher cost of leave entitlements for aged care workers whose wages have increased as a result of the FWC’s Stage 3 decision for the following providers delivering theHome Care Packages Program,CHSP,Transition Care Program,Short Term Restorative Care Program, andNational Aboriginal and Torres Strait Islander Flexible Aged Care ProgramTo view the grant opportunity documents, please select the red \"Grant Opportunity Documents\"button on the left-hand side.", "Eligibility": "Applications can only be accepted from Aged care service providers that have increased aged care worker wages as a result of the FWC’s Stage 3 decision, and:are an approved aged care provider of one or more of the programs listed below:Residential aged care;and / orHome Care Package Program;and / orCHSP;and / orTransition Care Program;and / orShort-Term Restorative Programme;and / orNational Aboriginal and Torres Strait Islander Flexible Aged Care Program.have in scope aged care workers whose wages have been increased as a result of the FWC Stage 3 decision and are employed under the following awards (or under an Agreement that is underpinned by these awards):Aged Care Award 2010Direct care aged care employees include assistants in nursing/nursing assistants, personal care workers, recreational or lifestyle activities officers; andGeneral and administrative services employees include administration staff, drivers, maintenance staff, gardeners, laundry hands, cleaners, and food services assistantsSocial, Community, Home Care and Disability Services Industry (SCHADS) Award 2010 (Schedule F)Home care employees whose primary role is to provide home care to aged care clients.Please note: If you employ workers through the Indigenous Employment Initiative and those workers have eligible accumulated leave liabilities as of 31 December 2024, include those workers in your claim", "Grant Activity Timeframe": "Potential grantees are advised that an election for the House of Representatives may be called before this grant process has been concluded. If an election is called and the House of Representatives is dissolved, then caretaker arrangements will apply to the business of Government. By convention, decisions are not taken during this period that would bind an incoming Government and limit its freedom of action. Consequently, potential grantees need to be aware that any grant processes which have not been concluded before the caretaker period, or which commence during the caretaker period, may experience delays in finalisation and could potentially be revised or cancelled.", "Total Amount Available (AUD)": "$21,326,000.00", "Instructions for Application Submission": "Submit the completed application form and all necessary attachments by the closing date and time via theOnline Application Formdocument located via the \"Grant Opportunity Documents\" button on the left-hand side.You should keep a copy of your application and any supporting documents. You will receive an automated email notification acknowledging the receipt of the submission which includes your Submission Reference ID. Retain this ID if you wish to query your application. If you do not receive an automated email notification within 48 hours of submission, please emailGrant.ATM@health.gov.au.", "Other Instructions": "Note the 2MB limit per attachment in the application form. Multiple files/documents should be scanned into a single document. Compressed or zip files are not accepted. File names must be unique and not include foreign characters.", "Addenda Available": "View Addenda"}, {"GO ID": "GO7516", "Agency": "Department of Social Services", "Close Date & Time": "6-Mar-2025 9:00 pm(ACT Local Time)Show close time for other time zones", "Internal Reference ID": "2024-3904", "Primary Category": "171004 - Services for People with Disabilities", "Publish Date": "12-Feb-2025", "Location": "ACT, NSW, VIC, SA, WA, QLD, NT, TAS", "Selection Process": "Targeted or Restricted Competitive", "FO Reference": "FO2024-3904", "Description": "The Australian Government is inviting Disability Representative Organisations (DROs) and Disabled People’s Organisations (DPOs) via a restricted process to apply under the Inclusion and Accessibility Fund: Australia’s Disability Strategy: Community Attitudes from 2025 to 2027.This grant opportunity will fund projects proposed by Disability Representative Organisations (DROs) and Disabled People’s Organisations (DPOs) that focus on reducing harm towards, and increasing inclusion of, people with disability. The objectives of the grant opportunity are to:lift the disability responsiveness and inclusive communication capability of key professional workforces.support grass roots efforts to create safety and inclusion in communities by improving understanding and shifting mindsets in relation to disability, and barriers to inclusion of people with disability.The intended outcomes include reduced harm towards people with disability through:improved community attitudesstrengthened opportunities for social participation, employment, and other outcomes.Grants can be used for research and development costs, delivery of tools and training, accessibility requirements and consultation.", "Eligibility": "To be eligible you must meet the criteria as a DRO/DPO and be one of the following entity types:CompanyCooperativeCorporate Commonwealth EntityCorporate State or Territory EntityIncorporated AssociationIndigenous CorporationLocal GovernmentNon-Corporate Commonwealth Statutory AuthorityNon-corporate State or Territory EntityNon-corporate State or Territory Statutory AuthorityPartnershipPersonSole TraderStatutory EntityUnincorporated Association.If you are applying as a Trustee on behalf of a Trust , the Trustee must be one of the eligible entity types listed above.Further information on entity types is available on theCommunity Grants Hubwebsite.", "Grant Activity Timeframe": "Assessment of applications - Within 4 weeks from the closing dateApproval of selection process outcomes - Within 6 weeks from the closing dateNotification to applicants - Within 6 weeks from the closing dateNegotiations and award of grant agreements - Within 9 weeks from the closing dateNotification to unsuccessful applicants - Within 9 weeks from the closing dateEarliest start date of grant activity - June 2025End date of grant activity - 30 June 2027.", "Instructions for Application Submission": "To apply, you must:complete the online application form onGrantConnectprovide all the information requestedaddress all eligibility criteria and assessment criteriasubmit your application to the Community Grants Hub by 9:00 pm AEDT on 6 March 2025.", "Other Instructions": "Please use:Australia's Disability Strategy - Community Attitudes - Questions and Answers - version 2", "Addenda Available": "View Addenda"}, {"GO ID": "GO7458", "Agency": "National Disability Insurance Agency (NDIA)", "Close Date & Time": "7-Mar-2025 5:00 pm(ACT Local Time)Show close time for other time zones", "Internal Reference ID": "PROC-4496", "Primary Category": "171004 - Services for People with Disabilities", "Publish Date": "7-Feb-2025", "Location": "ACT, NSW, VIC, SA, WA, QLD, NT, TAS", "Selection Process": "Targeted or Restricted Competitive", "Description": "The Quality Supports Supported Independent Living Pilot (SIL Pilot) is focussed on ensuring every National Disability Insurance Scheme (NDIS) participant has access to the highest quality supports.The NDIA has invited a select group of SIL providers to apply for a grant as part of the Quality Supports Program. Only providers who met the eligibility criteria set out in the Quality Supports SIL Pilot Grant Opportunity Guidelines have been invited to apply for the SIL Pilot.The pilots will focus on working with selected providers to identify features of quality service provision and cost models associated with providing quality services.The findings of the SIL Pilot will be used to inform future market approaches and pricing, as part of the Agency's commitment to a revised pricing approach.The SIL Pilot will commence in 2025 following a restricted competitive grant process with registered providers who meet specified eligibility criteria and are invited by the Agency to apply.Up to $20million in grant funding is available to support the SIL Pilot. This funding will offset the costs of selected SIL providers working closely with the NDIA to provide information and data on the cost models associated with providing quality services.", "Eligibility": "The Grant Opportunity Guidelines require that to be eligible SIL providers:hold current NSQC registration for all of the following registration groups as at 23 January 2025:Registration Group 0115: Assistance with Daily Life Tasks in a Group or Shared Living Arrangement;Registration Group 0107: Daily Personal ActivitiesRegistration Group 0104: High Intensity Daily Personal ActivitiesRegistration Group 0110: Specialist Positive Behaviour Supporthave provided and claimed SIL services to at least 50 participants (in Financial Year 2023/2024) with approved SIL funding.", "Grant Activity Timeframe": "June 2025 - June 2026", "Total Amount Available (AUD)": "$20,000,000.00", "Instructions for Application Submission": "By invitation only", "Addenda Available": "View Addenda"}, {"GO ID": "GO7536", "Agency": "National Disability Insurance Agency (NDIA)", "Close Date & Time": "7-Mar-2025 5:00 pm(ACT Local Time)Show close time for other time zones", "Internal Reference ID": "PROC-4674", "Primary Category": "171004 - Services for People with Disabilities", "Publish Date": "7-Feb-2025", "Location": "ACT, NSW, VIC, SA, WA, QLD, NT, TAS", "Selection Process": "Closed Non-Competitive", "Description": "This grant opportunity is an initiative under the NDIA’s Quality Supports program that will enable the NDIA with selected providers to identify features of quality service provision and cost models associated with providing quality services.Up to $2 million (GST inclusive) will be available to be distributed across eligible grant recipients.The grant opportunity will be conducted as a restricted non-competitive process where a selected group of registered providers of support coordination will be invited by the NDIA to apply. Applications will not be comparatively assessed against other applicants’ submissions but individually assessed based on the selection criteria.", "Eligibility": "You are only eligible to apply for this grant opportunity if you have received an invitation to apply from the NDIA.To be eligible you must:hold current (and have maintained for the previous three years) provider registration for Registration group 0106: Assistance in Coordinating or Managing Life Stages;hold current provider registration for Registration group 0132: Specialised Support Coordination;hold current (and have maintained for previous three years) registration status with the NDIS Quality and Safeguards Commission (NQSC) to deliver Level 2 support coordination services;provide and claim support coordination services (across both Level 2 and Level 3) to at least 50 NDIS participants per year, for the previous three financial years; andhave had at least 80 percent of your total NDIS claims be Level 2 support coordination claims, averaged over the previous three financial years.", "Grant Activity Timeframe": "April/May 2025 - April/May 2026", "Instructions for Application Submission": "You are only eligible to apply for this grant opportunity if you have received an invitation to apply from the NDIA."}, {"GO ID": "GO7321", "Agency": "Department of Health and Aged Care", "Close Date & Time": "11-Mar-2025 2:00 pm(ACT Local Time)Show close time for other time zones", "Internal Reference ID": "P6473", "Primary Category": "231015 - Mental Health", "Publish Date": "20-Nov-2024", "Location": "ACT, NSW, VIC, SA, WA, QLD, NT, TAS", "Selection Process": "Demand Driven", "FO Reference": "P6473", "Description": "The Postgraduate Psychology Incentive Program aims to support higher education providers who have created additional postgraduate psychology places in courses which lead to general registration and can lead to relevant areas of practice endorsement.Funding under the program will be available over 4 grant rounds, with one round opening each financial year from 2023-24 to 2026-27. Eligible organisations will be required to apply for each individual round as they become available on GrantConnect.In this grant opportunity (Round 2), funding of up to $14,525,500.00 (GST inclusive) is available in 2024-25.The program objectives include:• support higher education providers creating additional postgraduate places in relevant psychology courses;• allow more students to study postgraduate psychology; and• boost the psychology training pipeline by training more students that can go on to work in the mental health sector upon graduation.The intended outcomes of the program are:• to increase the availability of postgraduate places in relevant courses to support provisional psychologists to obtain general registration; and• provide interim actions to immediately address some of the known bottlenecks in the postgraduate psychology training pathway.We administer the program according to the Commonwealth Grant Rules and Principles (CGRPs).To view the grant opportunity documents, please select the red \"Grant Opportunity Documents\" button on the left-hand side.", "Eligibility": "Who is eligible to apply for a grant?To apply for funding under this grant opportunity you must:• have an Australian Business Number (ABN);• be registered for the purposes of GST;• have an account with an Australian financial institution;• be an Australian higher education provider approved to: offer Commonwealth Supported Places; and• offer postgraduate psychology courses which lead to general registration and can lead to the following areas of practice endorsement (as outlined on the Psychology Board of Australia website):• clinical neuropsychology;• clinical psychology;• community psychology;• counselling psychology;• health psychology;• educational and developmental psychology;• forensic psychology;• organisational psychology; and• sport and exercise psychologybe one of the following entity types:• an Aboriginal and/or Torres Strait Islander Corporation (registered under the Corporations (Aboriginal and /or Torres Strait Islander) Act 2006);• company;• corporate Commonwealth entity;• non-corporate Commonwealth statutory authority;• corporate state or territory entity;• non-corporate state or territory Entity;• non-corporate state or territory statutory authority;• local government;• cooperative;• incorporated association;• other incorporated entity;• statutory entity;• partnership; or• unincorporated association.", "Total Amount Available (AUD)": "$14,525,500.00", "Instructions for Application Submission": "Submit the completed application form and all necessary attachments by the closing date and time via the red Submit Application button on the left-hand side.You should keep a copy of your application and any supporting documents. Registered users will receive an automated email notification acknowledging the receipt of the submission. If you do not receive an automated email notification within 24 hours of submission, please email Grant.ATM@health.gov.au.For technical assistance when submitting your application through GrantConnect please contact the GrantConnect Helpdesk:• Phone: 1300 484 145• Email: GrantConnect@finance.gov.au", "Other Instructions": "Applicant/s should follow the below instructions to upload their application:• Filename(s) do not exceed 100 characters.• Any file type can be submitted to GrantConnect.• Refrain from using special characters. These include, but are not limited to, colon, forward and back slash, question marks, en and em dash.• A maximum of five (5) separate files can be submitted at one time.• Do not include macros or password protect applications or attachments.", "Addenda Available": "View Addenda"}, {"GO ID": "GO7523", "Agency": "National Indigenous Australians Agency", "Close Date & Time": "11-Mar-2025 3:00 pm(ACT Local Time)Show close time for other time zones", "Primary Category": "231001 - Addiction and Substance Abuse", "Secondary Category": "251005 - Indigenous Health", "Publish Date": "11-Feb-2025", "Location": "NSW", "Selection Process": "Targeted or Restricted Competitive", "Description": "The National Indigenous Australians Agency (NIAA) is inviting applications to provide a Moree Aboriginal Residential based Alcohol and Other Drugs Rehabilitation Service through a closed-competitive process.This opportunity is provided under the Indigenous Advancement Strategy’s Program 1.3 Safety and Wellbeing. Activities funded under this Program Stream include high quality, evidence based, culturally appropriate and safe Indigenous alcohol and other drug (AOD) treatment rehabilitation and support services.", "Eligibility": "Only Indigenous service providers that have been invited by NIAA can apply.", "Grant Activity Timeframe": "Outcomes must be delivered in 2025-26 and 2026-27.", "Total Amount Available (AUD)": "$3,090,000.00", "Estimated Grant Value (AUD)": "From$3,090,000.00to$3,090,000.00", "Instructions for Application Submission": "This is a restricted competitive funding round and applicants must be invited to apply by NIAA.Applications for funding must be submitted using the online application form."}, {"GO ID": "GO7285", "Agency": "Department of Climate Change, Energy, the Environment and Water", "Close Date & Time": "12-Mar-2025 5:00 pm(ACT Local Time)Show close time for other time zones", "Primary Category": "321002 - Technology", "Publish Date": "3-Dec-2024", "Location": "ACT, NSW, VIC, SA, WA, QLD, NT, TAS, Administered Territories", "Selection Process": "Targeted or Restricted Competitive", "Description": "The National Taxonomy Research Grants Program (NTRGP) 2025-26 grant opportunity provides grants for taxonomy and systematics research (herein referred to as taxonomy), training and recruitment of taxonomists.Grants will support projects with the primary aim of undertaking research into the taxonomy of the Australian biota. The ABRS has three Priority Areas for Research:Biodiversity, Conservation and Vulnerable and Endangered Species.Public, Plant, Animal and Environmental Health.Building Taxonomic Capacity.The objectives of the grant opportunity are:to support research into taxonomyto increase funding for taxonomy through enhanced co-funding opportunities.The intended outcomes of the grant opportunity are:to support and improve knowledge of the Australian biota through targeted taxonomic research grants aligned to the ABRS’s three Priority Areas for Researchto build Australia’s taxonomic capacity by supporting tertiary research training, early career researchers and facilitating knowledge transferto contribute to enhancing the ABRS information products and resources, including theAustralian Faunal Directory,Flora of Australia,Australian National Species List, publications, identification keys and any other taxonomic communication toolsto positively contribute to the fields of taxonomy and systematics.", "Eligibility": "You can apply if you:have an Australian business number (ABN)are an appropriate host institution (see section 14 of the grant opportunity guidelines) submitting an application on behalf of a Principal Investigator, scholarship student, or Non-salaried Researcher GrantAnd are one of the following entities:an entity, incorporated in Australia (this includes an Aboriginal and Torres Strait Islander Corporation registered under the Corporations (Aboriginal and Torres Strait Islander) Act 2006 (Cth))a co-operativea publicly funded research organisation (PFRO)an Australian local government agency or bodyan Australian State/Territory government agency or bodyan Australian Commonwealth government agency or body (excluding non-Corporate Commonwealth Entities)an incorporated association or not for profit organisation and you do not have an active state or territory incorporated association registration or ACNC registration at the time of application, provide the Constitutional documents and/or Articles of Association that demonstrate the character of the organisationa partnership, provide a copy of your partnership agreementFind the full eligibility criteria in the grant opportunity guidelines.", "Total Amount Available (AUD)": "$2,000,000.00", "Estimated Grant Value (AUD)": "From$5,000.00to$375,000.00", "Instructions for Application Submission": "Application open 9 January 2025.To apply, go to:www.business.gov.au/ntrgp", "Other Instructions": "business.gov.au provides information and advice to customers via a range of channels including phone (13 28 46), email and web chat.Contact usfor assistance.", "Addenda Available": "View Addenda"}, {"GO ID": "GO7367", "Agency": "National Health and Medical Research Council (NHMRC)", "Close Date & Time": "12-Mar-2025 5:00 pm(ACT Local Time)Show close time for other time zones", "Internal Reference ID": "1210", "Primary Category": "231013 - Medical Research", "Publish Date": "11-Dec-2024", "Location": "ACT, NSW, VIC, SA, WA, QLD, NT, TAS", "Selection Process": "Targeted or Restricted Competitive", "FO Reference": "TCR: High Healthcare Service Utilisation", "Description": "A Targeted Call for Research (TCR) is a one-time request for grant applications designed to stimulate research in a particular area that will benefit the health of Australians or address a specific health issue. A TCR specifies the scope and objectives of the research to be proposed, application requirements and procedures, and the review criteria to be applied in the evaluation of applications submitted in response to the TCR.The TCR: High Health Care Service Utilisation grant opportunity aims to effectively create a more balanced and efficient health care system. The proposed opportunity needs to be considered as an integral part of general health in primary care services. Addressing the needs of patients with high health care service utilisation, aiming to facilitate research that will improve understanding of where critical issues are for people to access timely and efficient health care servicesThe objectives of the TCR: High Healthcare Service Utilisation are to facilitate research that:examine high healthcare service utilisation from the points of view of people with lived experience and relevant stakeholders.  (i.e acute and primary care clinicians, funders, policy makers, service providers).gains in-depth understanding of the challenges facing people with different types of high healthcare service utilisation when managing their health, and the challenges facing clinician and health systems in trying to meet the needs of these vulnerable patients.investigate the effectiveness of existing services and models of care that are proven to improve patient outcomes and patient journeys.", "Eligibility": "Applications will only be accepted from NHMRC approved Administering Institutions. A list of NHMRC approved Administering Institutions is available at:NHMRC’s Administering Institutions | NHMRCApplications must satisfy all the requirements set out in the Targeted Call for Research: Addressing the Needs of People with High Healthcare Service Utilisation 2024 Guidelines.", "Grant Activity Timeframe": "Outcomes: Grants to be announced in November 2025, and the research output will be delivered for up to 5 years from commencement of the grant.", "Total Amount Available (AUD)": "$5,000,000.00", "Instructions for Application Submission": "Applications must be submitted electronically using Sapphire (unless otherwise advised by NHMRC).", "Other Instructions": "Minimum data is due 1700 (ACT local time) on 26 February 2025"}, {"GO ID": "GO7559", "Agency": "Department of Infrastructure, Transport, Regional Development, Communications and the Arts", "Close Date & Time": "13-Mar-2025 5:00 pm(ACT Local Time)Show close time for other time zones", "Internal Reference ID": "75", "Primary Category": "271003 - Media and Communications", "Publish Date": "17-Feb-2025", "Location": "ACT, NSW, VIC, SA, WA, QLD, NT, TAS", "Selection Process": "Targeted or Restricted Competitive", "Description": "In the 2024-25 Budget, the Australian Government provided funding to support the digital ability and literacy of First Nations Australians, to help progress Closing the Gap Target 17: By 2026, Aboriginal and Torres Strait Islander people have equal levels of digital inclusion, through the following programs:·         $4 million ($2 million per year, GST exclusive) over two years to establish the First Nations Digital Support Hub·         $18 million ($6 million per year, GST exclusive) over three years for a Network of Digital MentorsRefer to theNational Agreement on Closing the Gapfor more information on these targets and priority reforms.Both programs aim to improve First Nations digital inclusion by providing culturally safe advice and support to First Nations Australians regarding the use of telecommunications services, online safety, accessing essential services and troubleshooting connectivity issues. Delivery will be flexible to ensure the programs are responsive to changes in consumer experiences and expectations over time.The purpose of the First Nations Digital Support HubProgram (Digital Support Hub) is to support digital ability and connectivity literacy for First Nations people and communities, supporting and enabling skills development to be online safely and effectively, and to determine the connectivity options best for community members. It will provide this support through an online website, provide materials and resources, and telephone/email assistance. The Digital Support Hub will not be a walk-in centre that services customers in-person.The purpose of theNetwork of Digital Mentors Program (Network of Digital Mentors) is to establish and train a network of digital mentors in remote First Nations communities to assist people residing within those communities to enhance their access to connectivity, develop digital skills and literacy and to safely participate in the digital economy.", "Eligibility": "To be eligible for either grant, you must be one of the following organisations. Only listed organisations will be invited to apply.· First Nations Media Australia· Indigenous Technology- Land on Heart·Pilbara and Kimberly Aboriginal Media·The Centre for Appropriate Technology.This is a targeted, competitive grants process, meaning only Applicants who have been invited to submit applications may do so. You are not eligible to apply for either grant opportunity if you are not listed above as an invited organisation.Eligible Applicants were determined by the Department following public consultation on these guidelines, the First Nations Digital Inclusion package of 2024-25 Budget measures and First Nations Digital Inclusion Roadmap, and through extensive consultation with the First Nations Digital Inclusion Advisory Group and Digital Inclusion Expert Panel.We recognise that some organisations may want to join together as a group to deliver the First Nations Digital Support Hub Program and/or the Network of Digital Mentors Program.In these circumstances, you must appoint a ‘lead organisation’, which must be an organisation eligible to apply as specified in Section 4.1 of these guidelines. Only the lead organisation can submit the application form and enter into a grant agreement with the Commonwealth. The application must identify all other members of the proposed group and include a letter of support from each of the partners.", "Grant Activity Timeframe": "First Nations Digital Support Hub ProgramThe maximum grant period for the First Nations Digital Support Hub Program is up to 30 June 2026. The successful applicant must complete all grant activities by 30 June 2026.Network of Digital Mentors ProgramThe maximum grant period for the Network of Digital mentors is up to 30 June 2027. The successful applicant must complete all grant activities by 30 June 2027.An evaluation of the programs will be undertaken by the Department.", "Total Amount Available (AUD)": "$22,000,000.00", "Estimated Grant Value (AUD)": "From$0.00to$22,000,000.00", "Instructions for Application Submission": "Before applying, you must read and understand these guidelines, and the relevant sample application form and sample grant agreement.These documents may be found atGrantConnect. GrantConnect is the authoritative source for grants information. Any alterations and addenda will be published on GrantConnect and by registering on this website, you will be automatically notified of any changes to these guidelines.To apply you must:·complete and submit an application using the relevant sample application form available on GrantConnect (for either the Digital Support Hub, the Network of Digital Mentors or, or for both programs).·provide all the information requested·address all eligibility criteria and assessment criteria· include all necessary attachments.· submit your application(s) toFirstNationsDigitalInclusion@infrastructure.gov.auby the closing date and time stated at the front of these guidelines.", "Other Instructions": "In applying, applicants are responsible for ensuring that your application is complete and accurate.  If you find an error in your application after submitting it, you should contact us immediately atFirstNationsDigitalInclusion@infrastructure.gov.au.  We do not accept any additional information, or requests from you to correct your application after the closing time.You cannot change your application after the closing date and time."}, {"GO ID": "GO7395", "Agency": "Department of Home Affairs", "Close Date & Time": "13-Mar-2025 5:00 pm(ACT Local Time)Show close time for other time zones", "Primary Category": "271002 - Information Technology", "Secondary Category": "321002 - Technology", "Publish Date": "30-Jan-2025", "Location": "ACT, NSW, VIC, SA, WA, QLD, NT, TAS, Administered Territories", "Selection Process": "Open Competitive", "Description": "The Labelling Scheme for Smart Devices program (the program) will contribute towards building cyber security protections for consumers under the2023-2030 Australian Cyber Security Strategy(the Strategy) andHorizon 1 Action Plan.The objectives of the program are to:co-design and implement an industry-led and internationally aligned voluntary labelling scheme for consumer-grade smart devices in Australia.increase consumer awareness of the Government’s proposed mandatory minimum standard for consumer-grade smart devices in Australia.The intended outcomes of the program are:increased consumer understanding and awareness of the security of products available in the Australian marketenable consumers to make informed decisions about the level of security when purchasing smart devicesalign the Australian smart device market more closely with international best practicegreater adoption of security and privacy protections (secure-by-design features) by manufacturers of smart devices.The program will fund one eligible applicant up to a maximum of $1.7 million.The program will run over 3 years from 2024-25 to 2026-27, with funding available over 2 years from 2024-25.", "Eligibility": "You can apply if you:have an Australian business number (ABN)be registered for the goods and services tax (GST)have an account with an Australian financial institutionYou must also be an entity, incorporated in Australia.We can only accept applications:from an Internet of Things (IoT) peak body as defined in section 14 of the grant opportunity guidelineswhere you provide evidence of support from the board, CEO or equivalent. Where the CEO or equivalent submits the application, we will accept this as evidence of support.You can’t apply if you are:an organisation, or your project partner is an organisation, included on the National Redress Scheme’s list ofInstitutions that have not joined or signified their intent to join the Schemean employer of 100 or more employees that hasnot compliedwith the Workplace Gender Equality Act (2012)an individuala partnershipa Regional Development Australia Committeean unincorporated associationa trust (however, an incorporated trustee may apply on behalf of a trust)a Commonwealth, state, territory or local government body (including government business enterprises)a non-corporate Commonwealth entity.Partner with other organisationsYou can partner with one or more other organisations that also meet the eligibility criteria. But you must decide who the lead organisation is.The lead organisation must fill out the application form.If we give your group the grant, the lead organisation:signs the grant agreementis responsible for making sure your group follows the rules in the grant agreement.", "Total Amount Available (AUD)": "$1,700,000.00", "Instructions for Application Submission": "To apply, go to:www.business.gov.au/lsfsd", "Other Instructions": "business.gov.au provides information and advice to customers via a range of channels including phone (13 28 46), email and web chat.Contact usfor assistance."}, {"GO ID": "GO7355", "Agency": "Department of Education", "Close Date & Time": "14-Mar-2025 5:00 pm(ACT Local Time)Show close time for other time zones", "Primary Category": "131002 - Education Support", "Publish Date": "13-Jan-2025", "Location": "ACT, NSW, VIC, SA, WA, QLD, NT, TAS", "Selection Process": "Demand Driven", "Description": "The purpose of the grant is to provide support to ECEC students (through their provider) already working in the ECEC sector with a living and travel allowance (for up to four weeks) to assist them complete a practicum placement away from their home location. Funding is not designed to fully cover the exact cost of a student’s travel and living expenses whilst on their practicum exchange.Only CCS approved services, including long day care, family day care, in-home care, centre-based day care and outside school hours care services are eligible for this grant.The grant is targeted to services who have employees that will provide education and care as part of their practicum exchange in one of the following remoteness categories:·       Inner regional Australia·       Outer regional Australia·       Remote Australia·       Very remote Australia", "Eligibility": "Only ECEC services currently approved for and receiving the Childcare Subsidy (CCS) under Family Assistance Law, including long day care, family day care, in-home care, centre-based day care and outside school hours care services, are eligible and can apply for their employees.To be eligible for a grant the employee must:·       be undertaking their practicum exchange in a regional, remote or very remote location other than their home location·       be currently employed by the Provider and work at least 40 hours in the Service in a 3-month period·       have used the Practicum Exchange website to be matched to a service for their practicum period.The Providermust notbe receiving any funding from another source for the same practicum exchange activity.", "Total Amount Available (AUD)": "$308,700.00", "Estimated Grant Value (AUD)": "From$1,543.00to$1,543.00", "Instructions for Application Submission": "Please prepare and submit your application online atwww.secure-portal.com.au/ececgrantsThere are step by step instructions to assist approved Providers to navigate the application process.Enquiries can be emailed through toececgrants@deloitte.com.auor you can contact the Helpdesk on (03) 9917 7865 from 9am – 5pm AEDT Monday to Friday (while applications are open)."}, {"GO ID": "GO7504", "Agency": "Department of Foreign Affairs and Trade", "Close Date & Time": "17-Mar-2025 11:30 pm(ACT Local Time)Show close time for other time zones", "Primary Category": "371002 - International Organisations", "Publish Date": "22-Jan-2025", "Location": "Overseas", "Selection Process": "Closed Non-Competitive", "Description": "The purpose of the grant is to continue to support the 2 year establishment of the RCEP Support Unit (RSU) in line with meeting Australia’s commitments under the Regional Comprehensive Economic Partnership (RCEP), the world’s largest free trade agreement by members’ GDP. The RSU will provide technical and administrative support to the RCEP Joint Committee and its subsidiary bodies.", "Eligibility": "Refer to details in the Grant Guidelines", "Total Amount Available (AUD)": "$166,880.00", "Instructions for Application Submission": "Refer to details in the Grant Guidelines"}, {"GO ID": "GO7349", "Agency": "Department of Industry, Science and Resources", "Close Date & Time": "18-Mar-2025 5:00 pm(ACT Local Time)Show close time for other time zones", "Primary Category": "321001 - Science", "Publish Date": "4-Feb-2025", "Location": "ACT, NSW, VIC, SA, WA, QLD, NT, TAS, Administered Territories", "Selection Process": "Open Competitive", "Description": "The Prime Minister’s Prizes for Science – Aboriginal and Torres Strait Islander Knowledge Systems Prize honours Indigenous-led projects that benefit Australian Indigenous peoples, communities or place through the practice and preservation of Aboriginal and Torres Strait Islander knowledge systems.The Prime Minister’s Prizes for Science are an ongoing element of the Inspiring Australia – Science Engagement Program. The Prime Minister’s Prizes for Science will award up to $1.4 million each year for achievements across 3 prize categories:the Science Prizesthe Science Teaching Prizesthe Aboriginal and Torres Strait Islander Knowledge Systems Prize.The Prime Minister’s Prizes for Science are Australia’s most prestigious and highly regarded awards for achievements in scientific research and research-based innovation, the practice of Aboriginal and Torres Strait Islander knowledge systems and excellence in science teaching.The Prime Minister’s Prizes for Science celebrate Australian scientists and innovators, Aboriginal and Torres Strait Islander peoples who practice knowledge systems, and science teachers who are inspiring students to pursue science education and careers.", "Eligibility": "To be eligible for an Aboriginal and Torres Strait Islander Knowledge Systems Prize, a nominee must:be an Australian citizen or permanent resident of Australiabe:an Aboriginal and/or Torres Strait Islander person; ormembers of an Aboriginal and/or Torres Strait Islander-led team (including family groups); orrepresentatives of a community group.not be self-nominatednot have a concurrent nomination in the 2025 Science Prizes or the Science Teaching Prizespractice knowledge systems as part of a project with a demonstrable benefit to Australian Indigenous peoples, communities and/or place and to Australia more broadly.Find the full eligibility criteria in the grant opportunity guidelines.", "Total Amount Available (AUD)": "$250,000.00", "Instructions for Application Submission": "To apply, go to :www.business.gov.au/PMPSKS25", "Other Instructions": "business.gov.au provides information and advice to customers via a range of channels including phone (13 28 46), email and web chat.Contact usfor assistance."}, {"GO ID": "GO7423", "Agency": "Australian Research Council", "Close Date & Time": "18-Mar-2025 5:00 pm(ACT Local Time)Show close time for other time zones", "Internal Reference ID": "DE26 Round 1", "Primary Category": "381001 - Science, Technology, Engineering and Mathematics (STEM) Research", "Secondary Category": "381002 - Humanities, Arts and Social Sciences (HASS) Research", "Publish Date": "30-Jan-2025", "Location": "ACT, NSW, VIC, SA, WA, QLD, NT, TAS", "Selection Process": "Targeted or Restricted Competitive", "FO Reference": "DprogF2024", "Description": "The DECRA grant opportunity provides focused research support for early career researchers in both teaching and research, and research-only positions.The DECRA scheme objectives are to:support outstanding early-career researchers with demonstrated capacity for high-quality research and emerging capability for leadership and supervision;foster collaboration, with national or international researchers;support excellent and innovative research that addresses a significant problem or gap in knowledge and represents value for money;create new or advanced knowledge resulting from the outcomes of the research with economic, commercial, environmental, social and/or cultural benefits for Australia; andadvance promising early career researchers and promote enhanced opportunities for diverse career pathways in high-quality and supportive environments.The intended outcome of the Discovery Program is to contribute to the growth of Australia’s research and innovation capacity. Increasing Australia’s research and innovation capacity generates new knowledge and results in the development of new technologies, products and ideas, the creation of jobs, economic growth and an enhanced quality of life in Australia.", "Eligibility": "An application may only be submitted through the Research Office of an Eligible Organisation listed in the Grant Guidelines.EligibilityA DECRA participant must satisfy the eligibility criteria as listed in the relevant Grant Guidelines.A previous recipient, or an individual who has been nominated for a DECRA on two previous occasions, is not eligible to apply for another DECRA. This includes withdrawn and ineligible applications.To be eligible, the candidate must, as at the grant opportunity closing date:not be nominated for more than one DECRA in a grant opportunity;have met their obligations regarding previously funded projects, including submission of satisfactory final reports to the ARC at the grant opportunity closing date;have an award of PhD date on, or after 1 March 2020; orhave an award of PhD date together with an allowable period of career interruptions that would be commensurate with an award of PhD date on, or after 1 March 2020. The allowable career interruptions, and the period allowed for each, is available in the Instructions to Applicants and the ‘Eligibility and Career Interruptions Statement’ on the ARC website.If a DECRA candidate has more than one PhD, the earliest awarded PhD must fall within this timeframe.A DECRA candidate can be concurrently funded through the Discovery Program for a maximum of: one ARC Fellowship and one project as a CI; or one ARC Fellowship or project if the individual is also a Director on an active ARC Centre of Excellence and/or a Special Research Initiative project.Applications for DECRA don’t need to meet the project limit requirements at the grant opportunity closing date. If successful, project limits must be met before the project can start. Refer to the Instructions to Applicants for more information.", "Grant Activity Timeframe": "DECRA funding and grant duration is three consecutive years on a full-time basis. The DECRA may be undertaken on either a full-time, or a part-time basis subject to the Administering Organisation’s employment conditions and provided that the DECRA does not exceed 6 consecutive years. ARC approval for the conversion to part-time must be requested by submitting a variation.", "Estimated Grant Value (AUD)": "From$380,079.00to$530,079.00", "Instructions for Application Submission": "The application must be submitted as a mature research plan presenting the proposed project ready for implementation and must contain all the information necessary for its assessment without the need for further written or oral explanation, or reference to additional documentation, unless requested by the ARC.The ARC reserves the right to change these criteria in future funding rounds. Grant Guidelines for all ARC schemes may be found attached to the relevant Grant Opportunity.Administering Organisations must submit Applications through the Research Management System (RMS) unless otherwise advised by the ARC.All applications must meet the format and content requirements, including certification, as set out in the RMS online form and the relevant scheme Instructions to Applicants.", "Other Instructions": "The RMS is a web-based system used to prepare and submit research applications, requests not to assess, assessments and rejoinders for the ARC’s National Competitive Grants Program (NCGP).Registered users can log in using their email address and password athttps://rms.arc.gov.auTo request a new account, please go tohttps://rms.arc.gov.auand click on the Request New Account link.", "Addenda Available": "View Addenda"}, {"GO ID": "GO7550", "Agency": "Department of Infrastructure, Transport, Regional Development, Communications and the Arts", "Close Date & Time": "18-Mar-2025 11:30 pm(ACT Local Time)Show close time for other time zones", "Internal Reference ID": "Festivals-R20-2025", "Primary Category": "121006 - Performing Arts", "Secondary Category": "141000 - Community Development", "Publish Date": "18-Feb-2025", "Location": "ACT, NSW, VIC, SA, WA, QLD, NT, TAS", "Selection Process": "Open Competitive", "FO Reference": "Festivals-R20-2025", "Description": "Festivals Australia provides funding to support individual art projects in regional or remote locations. Eligible projects take place at festivals, or significant one-off community events such as a town celebration or opening of a new community resource. Festivals Australia will:provide access to a diverse range of engaging, innovative arts projects that grow audiences at festivals across regional and remote Australia,support partnerships and collaboration across the arts sector, andencourage community participation in arts projects at regional and remote festivals.The program delivers two funding rounds each year usually opening in February and September. The Minister for the Arts (or their delegate) approves funding under the Program Guidelines.To check if your project is taking place in an eligible location, visit theFestivals Australia Eligibility Map. Enter the full address where your project will be delivered into the search box, or click on the location on the map. The remoteness classification, and whether this location is eligible, will be displayed.", "Eligibility": "To be eligible for funding, applicants mustbe an Australian incorporated organisation*,have an active Australian Business Number (ABN),be registered for the purposes of GST, if required by the Australian Taxation Office, andnot have any outstanding reports, acquittals or serious breaches relating to any Australian Government funding.Applicants from the Australian external territories, such as Norfolk Island, are eligible to apply.Unincorporated groups are eligible for funding but must be auspiced by an organisation that meets the above criteria.Festivals Australia does not fund projects that take place in major cities or metropolitan locations.", "Grant Activity Timeframe": "Funding is available for activities commencing from 1 July 2025.", "Total Amount Available (AUD)": "$700,000.00", "Instructions for Application Submission": "Applications can be made online via theSubmit Applicationlink."}, {"GO ID": "GO7081", "Agency": "Department of Industry, Science and Resources", "Close Date & Time": "20-Mar-2025 5:00 pm(ACT Local Time)Show close time for other time zones", "Primary Category": "261001 - Industry Innovation", "Secondary Category": "321003 - Scientific Research", "Publish Date": "6-Feb-2025", "Location": "ACT, NSW, VIC, SA, WA, QLD, NT, TAS, Administered Territories", "Selection Process": "Open Competitive", "Description": "Cooperative Research Centres Projects (CRC-P) Grants provide funding for short-term research collaborations. Find out how to apply for a CRC-P Grant to develop a new technology, product or service.This grant supports short-term (up to 3 years), industry-led research collaborations.Projects must:develop a product, service or process that will solve problems for industry and deliver real outcomesbenefit small to medium enterprises (SMEs)include education and training activities.You can use the funding to cover costs directly related to your project including:new researchproof of concept activitiespre-commercialisation of research outcomesindustry-focused education and training activitiesconferences, workshops, symposia related to the joint researchinformation sharing and communications related to the research.This is not a complete list and other costs may also be eligible.", "Eligibility": "To be eligible as a lead applicant you must:be an SMEhave an Australian business number (ABN)be incorporated in Australia and a trading corporation.Your trading activities must be either:enough to be called a trading corporationa major, not minor, part of your overall activity.Project partners must include:2 Australian industry organisations1 Australian research organisation.", "Instructions for Application Submission": "To apply, go to:business.gov.au/crc-p", "Other Instructions": "business.gov.au provides information and advice to customers via a range of channels including phone (13 28 46), email and web chat.Contact usfor assistance."}, {"GO ID": "GO7549", "Agency": "Department of Foreign Affairs and Trade", "Close Date & Time": "23-Mar-2025 11:30 pm(ACT Local Time)Show close time for other time zones", "Primary Category": "141000 - Community Development", "Publish Date": "14-Feb-2025", "Location": "Overseas", "Selection Process": "Open Competitive", "Description": "The Australia-Cook Islands Community Grants Program (ACCGP) will provide small grants to support local organisations and individuals address local priorities, including education, gender equality, disability, economic empowerment and grassroots sporting organisations. Funding will be provided via small grants of approximately AUD 5,000 to AUD 15,000 each, up to an annual value of AUD 100,000. The ACCGP application round is open from 14 February 2025 to 23 March 2025.", "Eligibility": "To be eligible, applicants must be one or more of the following: 1. Cook Islands residents; 2. Cook Islands registered community organisations;  3. Entities with an existing partnership with a Cook Islands organisation; 4. Non-government organisations and charitable trusts operating in Cook Islands; and/or 5. Other entities engaged in development activities in Cook Islands.All grant activities must be in the Cook Islands. Relevant personnel working on the grant activity must demonstrate adhering to the following policies:DFAT Preventing Sexual Exploitation, Abuse and Harassment Policy;DFAT Environmental and Social Safeguard Policy; andDFAT Child Protection Policy.Refer to further details/instructions in the Grant Guidelines.", "Total Amount Available (AUD)": "$100,000.00", "Estimated Grant Value (AUD)": "From$5,000.00to$15,000.00", "Instructions for Application Submission": "Applicants must complete the following steps to submit applications electronically: 1. complete the online ACG24 application form onSmartyGrants; 2. provide all the information requested; 3. address all eligibility criteria and assessment criteria; 4. include all necessary attachments; 5. submit application/s onSmartyGrantsby the deadline. Late applications will not be entertained. Applicants are responsible for ensuring that grant application is complete, accurate and includes the required supporting documentation.Refer to further details/instructions in the Grant Guidelines and theSmartyGrantsapplication form.", "Addenda Available": "View Addenda"}, {"GO ID": "GO7566", "Agency": "Department of Social Services", "Close Date & Time": "24-Mar-2025 9:00 pm(ACT Local Time)Show close time for other time zones", "Internal Reference ID": "2024-3860", "Primary Category": "131007 - Youth Services", "Publish Date": "24-Feb-2025", "Location": "SA, NT", "Selection Process": "One-off/Ad hoc", "Description": "The Australian Government is inviting organisations from Palmerston, Northern Territory and Port Augusta, South Australia via an ad hoc process to apply to deliver services under the Program 2.1 - Families and Communities – Family Safety – Supporting Adolescent Boys Trial from early 2025 to June 2027. During this period, grant recipients will provide individual counselling and therapeutic support to eligible young men and boys aged 12 to 18 years at selected trial sites across Australia.The objective of the Trial is to test a therapeutic individual support service that is trauma and healing informed for young men and adolescent boys to:support participants’ recovery and healing from their experience of family and domestic violencehelp participants to avoid choosing to use Family, Domestic and Sexual Violence (FDSV)build the evidence base on effective support service approaches to supporting young men and boys exposed to family and domestic violence to reduce the risk of them using FDSV.An independent evaluation of services delivered under the Trial will be conducted through a separate arrangement.", "Eligibility": "To be eligible to receive a grant you must be one of the invited organisations and have received an invitation to apply for this grant opportunity.", "Instructions for Application Submission": "By invitation only."}, {"GO ID": "GO7508", "Agency": "Department of Foreign Affairs and Trade", "Close Date & Time": "24-Mar-2025 11:30 pm(ACT Local Time)Show close time for other time zones", "Primary Category": "341000 - Trade and Tourism", "Publish Date": "10-Feb-2025", "Location": "ACT", "Selection Process": "Open Competitive", "Description": "The grant program has been established to support and inform the Department of Foreign Affairs and Trade’s review of Australia’s FTAs in Southeast Asia. The grant program will support trade exposed industry peak bodies and representative organisations conduct research and analysis to identify opportunities, make recommendations and identify priorities for improved utilisation, upgrade and modernisation of Australia’s network of free trade agreements in Southeast Asia, and feed into the department’s Southeast Asia FTA upgrade and modernisation review.In preparing applications, you should read theTerms of Referencefor the review and the Grant Guidelines", "Eligibility": "To be eligible to receive a grant, the potential grantee must: have an Australian Business Number (ABN); be registered for the purposes of GST; have an account with an Australian financial institution; and be one of the following entity types: a company incorporated in Australia; a company incorporated by guarantee; an incorporated trustee on behalf of a trust; an incorporated association; a joint (consortia) application with a lead organisation; a registered charity or not-for-profit organisation; a publicly funded research organisation; an Aboriginal and/or Torres Strait Islander Corporation registered under theCorporations (Aboriginal and /or Torres Strait Islander) Act 2006; a peak industry body, representative organisation or members organisation. Refer to Grant Guidelines for more detail.", "Estimated Grant Value (AUD)": "From$100,000.00to$250,000.00", "Instructions for Application Submission": "Applications are to be submitted electronically through SmartyGrants. Further information is contained within the guidelines and the SmartyGrants application form."}, {"GO ID": "GO7462", "Agency": "Australian Research Council", "Close Date & Time": "27-Mar-2025 5:00 pm(ACT Local Time)Show close time for other time zones", "Internal Reference ID": "CE26 Round 1", "Primary Category": "381002 - Humanities, Arts and Social Sciences (HASS) Research", "Secondary Category": "381001 - Science, Technology, Engineering and Mathematics (STEM) Research", "Publish Date": "14-Jan-2025", "Location": "ACT, NSW, VIC, SA, WA, QLD, NT, TAS", "Selection Process": "Targeted or Restricted Competitive", "FO Reference": "CE2026", "Description": "The ARC Centres of Excellence grant opportunity facilitates significant collaboration at scale which enables the complementary resources of universities, other research organisations, governments and businesses, not for profit organisations to support outstanding pure basic, strategic basic and/or applied research in all fields (except medical research).The ARC Centres of Excellence scheme objectives are to:• undertake internationally innovative, collaborative and transformational interdisciplinary research to address the most challenging and significant research problems, advance knowledge, and deliver knowledge impact;• synergise Australian research strengths, create new national and international networks and research programs to ensure that Australian research builds critical mass, is globally connected and has the capacity to work on large-scale problems over an extended period of time;• build capacity and a diverse and inclusive Australian research workforce by attracting and retaining, from within Australia and abroad, established researchers of high international standing as well as high potential early and mid-career researchers and research students;• develop an exemplary research culture that provides high-quality career development opportunities for research students and early and mid-career researchers and promotes a diverse, equitable and inclusive research environment;• establish research programs that lead to significant knowledge impact and end-user impact through the delivery of outcomes for partners including industry (private sector, not-for-profits, community groups, and/or government and government agencies); and• create new knowledge and understanding that is value for money, with the potential to enhance the scale and focus of research in Australian Government priority areas and deliver economic, commercial, environmental, social and/or cultural benefits for Australia.", "Eligibility": "Applications will only be accepted from the Eligible Organisations listed within the Grant Guidelines. Applications must each include at least one Other Eligible Organisation and at least one other Partner Organisation. Applications must include the following named participants:Centre Director;at least one other Chief Investigator;one or more Partner Investigators.Applications must have been shortlisted by the ARC in the Expression of Interest process to be eligible to submit.", "Grant Activity Timeframe": "An application may be applied for and awarded funding for a minimum of two to a maximum of five consecutive years.", "Estimated Grant Value (AUD)": "From$1,000,000.00to$5,000,000.00", "Instructions for Application Submission": "The Application must be submitted as a mature research plan presenting the proposed project ready for implementation and must contain all the information necessary for its assessment without the need for further written or oral explanation, or reference to additional documentation, unless requested by the ARC.Applicants should note the eligibility criteria for access to other funding schemes, as expressed in the Grant Guidelines for those schemes. The ARC reserves the right to change these criteria in future funding rounds. Grant Guidelines for all ARC schemes may be found attached to the relevant Grant Opportunity.Administering Organisations must submit applications through the Research Management System (RMS) unless otherwise advised by the ARC.All applications must meet the format and content requirements, including certification, as set out in the RMS online form and the Instructions to Applicants for ARC Centres of Excellence for funding commencing in 2026.", "Other Instructions": "The RMS is a web-based system used to prepare and submit research applications, assessments and rejoinders for the ARC National Competitive Grants Program.Registered users can login using your email address and password athttps://rms.arc.gov.au.To request a new account, please go tohttps://rms.arc.gov.auand click on the Request New Account link.All queries by researchers should be directed to the Administering Organisation of the application.", "Addenda Available": "View Addenda"}, {"GO ID": "GO7375", "Agency": "Department of Infrastructure, Transport, Regional Development, Communications and the Arts", "Close Date & Time": "28-Mar-2025 5:00 pm(ACT Local Time)Show close time for other time zones", "Primary Category": "351001 - Infrastructure", "Publish Date": "18-Dec-2024", "Location": "ACT, NSW, VIC, SA, WA, QLD, NT, TAS, Administered Territories", "Selection Process": "Closed Non-Competitive", "Description": "The Stronger Communities Programme (the program) supports the Australian Government’s commitment to deliver social benefits in communities across Australia by funding projects in each of the 151 Federal electorates. The program provides grants for community projects to strengthen and benefit local communities and is part of the Government’s 2024-25 budget initiatives.The objective of the program is to deliver infrastructure projects that provide social benefits for local communities, by supporting one or more of the following:support or encourage interstate or international tourismsupport or celebrate Indigenous Australianscommemorate Australians killed or injured in war or who contributed to Australia’s war effortssupport veterans and defence force members and their families and communitiessupport the participation and settlement of newly arrived (i.e. within the last 5 years) immigrants who are not citizenssupport the acquisition or deployment of greenhouse gas emissions mitigation measuressupport the dignity of persons (including children) with disabilities by enhancing their access to public infrastructuresupport access for children to public infrastructure which enables interstate or overseas travel, accommodation, or education or health care infrastructure or servicesaddress gender inequality or discrimination in access to public infrastructure or sportprovide medical services or facilities, or services or facilities incidental to the provision of medical servicesprovide benefits to a specific cohort or cohorts of studentsenable or foster the use of electronic communications.The intended outcomes of the program are to:encourage and support participation in local projectsimprove local community participationcontribute to vibrant and viable communities.", "Eligibility": "You can apply if you:are invited to apply by your local MPhave an Australian business number (ABN)meet the eligibility requirements in section 4.1 of the grant opportunity guidelines.You can apply if you are one of the following entities:an incorporated not for profit entity, such as:Police and Citizen Youth Clubschildcare centressurf clubslocal aged care bodiesParents and Citizens, Parents and Friends groups and equivalent bodiesa Commonwealth, state or territory government agency or entity that is a fire service, rural fire service, country fire authority, state emergency service or similar.non-distributing co-operativescompanies limited by guaranteeAustralian Indigenous corporationsreligious organisations incorporated under legislation.an incorporated trustee on behalf of a trust with responsibility for a community asset or property. You will be required to provide relevant trust documentsa local governing body as defined by the Local Government (Financial Assistance) Act 1995.For the purpose of this program, we also consider the following organisations to be local governing bodies:Anangu Pitjantjatjara, Maralinga, Gerard, Nepabunna and Yalata local governing bodies in SACocos (Keeling) Islands Shire CouncilLord Howe Island BoardNorfolk Island Regional CouncilThe Outback Communities AuthorityThe Shire of Christmas IslandThe Silverton and Tibooburra villages in NSWThe Trust Account in the NTACT Government.Find the full eligibility criteria in the grant opportunity guidelines.", "Total Amount Available (AUD)": "$22,650,000.00", "Estimated Grant Value (AUD)": "From$2,500.00to$20,000.00", "Instructions for Application Submission": "Applications open 14 February 2025.Eligible applicants will be invited to apply.", "Other Instructions": "business.gov.au provides information and advice to customers via a range of channels including phone (13 28 46), email and web chat.Contact usfor assistance.", "Addenda Available": "View Addenda"}, {"GO ID": "GO7525", "Agency": "National Indigenous Australians Agency", "Close Date & Time": "31-Mar-2025 2:00 pm(ACT Local Time)Show close time for other time zones", "Internal Reference ID": "4-KDWIKA7", "Primary Category": "201003 - Transition to Work", "Publish Date": "4-Feb-2025", "Location": "NSW, SA, WA, QLD, NT", "Selection Process": "Open Competitive", "FO Reference": "Remote Jobs and Economic Development Program", "Description": "The RJED program seeks to fund 3,000 new jobs over three years to support job seekers currently participating in or are eligible for Remote Employment Services (RES), the New Jobs Program Trial (NJPT), or the CDP Trialling Pathways to Remote Employment (CDP Trials) to move into employment. There are two streams of funding available, Job Creation – to fund the cost of wages and related entitlements, and the Community Jobs and Business Fund (CJBF) – to provide funding for equipment, operational costs and infrastructure to directly support bringing jobs created under the Job Creation stream into existence.For the purpose of the RJED program, a new job is:a job which does not already exist within an organisation and does not displace an existing employee, ora job created under the NJPT or CDP Trials.As job allocations are based on NIAA regions, you will need submit a separate application for each NIAA region where you intend to deliver a job. For example:If you apply for jobs located in more than one RES region, but all those jobs are in the same NIAA region, you will only need to submit one application for those jobs.If you apply for jobs located in more than one RES region, and those jobs are in different NIAA regions, you will need to submit a separate application for the jobs in each NIAA region.Further guidance on the linkages between RES regions and NIAA regions are in the RJED Grant Opportunity Guidelines (RJED GOGs) at Appendix 3.For information about how the Agency manages personal information in the administration of its grants, please see the Grants and Funding page of the NIAA website -https://www.niaa.gov.au/indigenous-affairs/grants-and-funding.General information about the Agency’s privacy policies is also included below", "Eligibility": "The Agency cannot consider applications that do not satisfy all the eligibility criteria.Organisations that are not eligible to apply for funding are encouraged to consider partnering with an eligible organisation.To be eligible to receive funding you must be an eligible organisation offering an eligible job to an eligible employee.", "Grant Activity Timeframe": "Over three (3) years.", "Total Amount Available (AUD)": "$17,600,000.00", "Instructions for Application Submission": "You must submit your application form online.  You will receive an electronic Application ID Number once your application has been lodged with the Agency. You should keep a copy of your application, Application ID Number and any supporting documents.If you find an error in your application after submitting it, you should contact the NIAA at IASAMO@niaa.gov.au.If we find an error or information that is missing, we may ask for clarification or additional information from you that will not change the nature of your application. The Agency can refuse to accept any additional information from you that would change your application after it has been received by the Agency.", "Addenda Available": "View Addenda"}, {"GO ID": "GO7080", "Agency": "Department of Health and Aged Care", "Close Date & Time": "31-Mar-2025 5:00 pm(ACT Local Time)Show close time for other time zones", "Primary Category": "231013 - Medical Research", "Publish Date": "4-Oct-2024", "Location": "ACT, NSW, VIC, SA, WA, QLD, NT, TAS, Administered Territories", "Selection Process": "Open Competitive", "Description": "The 2024 National Critical Research Infrastructure initiative invests in research infrastructure to ensure Australian researchers find innovative solutions to complex health problems in areas of unmet medical need. This grant opportunity has four streams.Stream 1 – Innovation enablersAddresses an area of unmet medical need by promoting the development and implementation of new research infrastructure by supporting development and/or expansion of research enablers such as biobanks, tissue repositories, novel research platforms, and secure health data environments to create valuable research resources.Stream 2 – Digitisation of health careDeveloping and translating into practice digital therapeutics, artificial intelligence enabled health interventions and technologies (e.g. wearables integrated into clinical practice), applications or other software for use in clinical practice.Stream 3 – Co-investment partnershipsUtilising co-investment (cash only) with the research sector, state and/or territory governments, and industry, in significant critical research infrastructure (e.g. facilities, personnel and equipment):to support development of research capacity, capability and/or effectiveness in an area of unmet medical need, orto enable Australian research using new platforms, systems and services in an area of unmet medical need.Stream 4 – mRNA technology enablersLeveraging and enhancing emerging mRNA technologies, platforms, and/or equipment to accelerate development of mRNA-based vaccines and therapeutics in an area of unmet medical need.An application may only be submitted to one of the above four streams only. Applicants must specify the stream to which they are applying in their application.", "Eligibility": "You can apply if you:have an Australian business number (ABN)are incorporated in Australiaand in accordance with s24 of theMedical Research Future Fund Act 2015, are one of the following entities:a medical research institutea universitya corporate Commonwealth entitya corporation (including businesses and not for profits).You can’t apply if you are:an organisation, or your project partner is an organisation, included on the National Redress Scheme’s list ofInstitutions that have not joined or signified their intent to join the Schemean employer of 100 or more employees that hasnot compliedwith theWorkplace Gender Equality Act (2012)an individuala partnershipan unincorporated associationa trust (however, an incorporated trustee may apply on behalf of a trust)a non-corporate Commonwealth entityany organisation not listed in the eligible entity list.Partner with other organisationsJoint applications are encouraged.You can partner with one or more other organisations but you must decide who the lead organisation is.Stream 3 applications must be from a consortia (including the applicant):of at least one academic organisation and at least one other organisation which may be industry or state/territory governmentwith combined cash contributions of at least 34% of the total eligible project costs.The lead organisation must fill out the application form and enter into the grant agreement with the Commonwealth.If we give your group the grant, the lead organisation:signs the grant agreementreceives grant paymentsis responsible for making sure your group follows all requirements in the grant agreement, including all reporting requirements.", "Total Amount Available (AUD)": "$76,000,000.00", "Instructions for Application Submission": "To apply, go to:business.gov.au/2024-NCRII", "Other Instructions": "business.gov.au provides information and advice to customers via a range of channels including phone (13 28 46), email and web chat.Contact usfor assistance."}]